Repository: nohwnd/vstest
Catalog: src/Microsoft.TestPlatform.CommunicationUtilities/Resources/xlf/Resources.*.xlf
Languages: cs, fr, it, pl, pt_br, ru, tr, zh_hans, zh_hant

# AbortedTestRun
source: The active test run was aborted. Reason: {0}
cs: Aktivní testovací běh se přerušil. Důvod: {0}
fr: La série de tests active a été abandonnée. Raison : {0}
it: L'esecuzione dei test attivi è stata interrotta. Motivo: {0}
pl: Aktywny przebieg testu został przerwany. Przyczyna: {0}
pt_br: A execução de teste ativa foi anulada. Motivo: {0}
ru: Активный тестовый запуск прерван. Причина: {0}
tr: Etkin test çalıştırması iptal edildi. Nedeni: {0}
zh_hans: 活动的测试运行已中止。原因: {0}
zh_hant: 使用中的測試回合已中止。原因: {0}

# ConnectionClosed
source: An existing connection was forcibly closed by the remote host.
cs: Vzdálený hostitel vynutil ukončení existujícího připojení.
fr: Une connexion existante a été fermée de force par l'hôte distant.
it: Una connessione esistente è stata chiusa forzatamente dall'host remoto.
pl: Zamknięcie istniejącego połączenia zostało wymuszone przez host zdalny.
pt_br: Uma conexão existente foi fechada à força pelo host remoto.
ru: Существующее подключение принудительно закрыто удаленным узлом.
tr: Mevcut bir bağlantı uzak konak tarafından zorla kapatıldı.
zh_hans: 现有连接被远程主机强制关闭。
zh_hant: 遠端主機已強制關閉現有連線。

# AbortedTestDiscovery
source: The active test discovery was aborted. Reason: {0}
cs: Aktivní zjišťování testu se přerušilo. Důvod: {0}
fr: La découverte de tests active a été abandonnée. Raison : {0}
it: L'individuazione dei test attivi è stata interrotta. Motivo: {0}
pl: Aktywny proces wykrywania testu został przerwany. Przyczyna: {0}
pt_br: A descoberta de teste ativa foi anulada. Motivo: {0}
ru: Активное обнаружение тестов прервано. Причина: {0}
tr: Etkin test bulma iptal edildi. Nedeni: {0}
zh_hans: 活动的测试发现已中止。原因: {0}
zh_hant: 使用中的測試探索已中止。原因: {0}

# UnableToCommunicateToTestHost
source: Unable to communicate with test host process.
cs: Nepovedlo se navázat komunikaci s procesem hostitele testu.
fr: Impossible de communiquer avec le processus hôte du test.
it: Non è possibile comunicare con il processo host dei test.
pl: Nie można nawiązać komunikacji z procesem hosta.
pt_br: Não é possível se comunicar com o processo de host de teste.
ru: Не удалось связаться с хост-процессом теста.
tr: Test ana bilgisayarı işlemi ile iletişim kurulamıyor.
zh_hans: 无法与测试宿主进程通信。
zh_hant: 無法與測試主機處理序通訊。

# UnexpectedMessage
source: Unexpected message received. Expected MessageType : {0} Actual MessageType: {1}
cs: Byla přijata neočekávaná zpráva. Očekávaný typ zprávy: {0} Skutečný typ zprávy: {1}
fr: Message inattendu reçu. MessageType attendu : {0} MessageType réel : {1}
it: È stato ricevuto un messaggio imprevisto. Tipo di messaggio previsto: {0}. Tipo di messaggio effettivo: {1}
pl: Otrzymano nieoczekiwany komunikat. Oczekiwany typ komunikatu: {0}, otrzymany typ komunikatu: {1}
pt_br: Mensagem inesperada recebida. MessageType esperada: {0} MessageType real: {1}
ru: Получено непредвиденное сообщение. Ожидаемый тип сообщения (MessageType): {0}, фактический тип сообщения (MessageType): {1}
tr: Beklenmeyen ileti alındı. Beklenen MessageType: {0} Gerçek MessageType: {1}
zh_hans: 收到意外消息。意外 MessageType: {0} 实际 MessageType: {1}
zh_hant: 收到未預期的訊息。需要的訊息類型: {0}，實際的訊息類型: {1}

# VersionCheckFailed
source: Protocol version check failed. Make sure test runner and host are compatible.
cs: Kontrola verze protokolu selhala. Ověřte, jestli je spouštěč testů kompatibilní s hostitelem.
fr: Échec de la vérification de la version du protocole. Vérifiez que Test Runner et l'hôte sont compatibles.
it: Il controllo della versione del protocollo non è riuscito. Assicurarsi che runner e host dei test siano compatibili.
pl: Sprawdzanie wersji protokołu nie powiodło się. Upewnij się, że moduł uruchamiający testy i host są zgodne.
pt_br: Falha na verificação da versão do protocolo. Verifique se o executor de testes e o host são compatíveis.
ru: Проверка версии протокола не пройдена. Убедитесь, что средство запуска теста и узел совместимы.
tr: Protokol sürümü denetlenemedi. Test çalıştırıcısı ve ana bilgisayarının uyumlu olduğundan emin olun.
zh_hans: 协议版本检查失败。请确保测试运行程序和主机兼容。
zh_hant: 通訊協定版本檢查失敗。請確定測試執行器與主機相容。

# VersionCheckTimedout
source: Failed to negotiate protocol, waiting for response timed out after {0} seconds. This may occur due to machine slowness, please set environment variable {1} to increase timeout.
cs: Nepodařilo se vyjednat protokol. Po {0} s vypršel časový limit čekání na odezvu. Důvodem může být pomalý počítač. Nastavením proměnné prostředí {1} prosím časový limit prodlužte.
fr: Échec de négociation du protocole, en attente d’une réponse dont le délai expire après {0} secondes. Cette situation peut se produire à cause de la lenteur de la machine. Définissez la variable d’environnement {1} de sorte à augmenter le délai d’expiration.
it: Non è stato possibile negoziare il protocollo: in attesa del timeout della risposta dopo {0} secondi. Questo problema può verificarsi a causa della lentezza del computer. Impostare la variabile di ambiente {1} in modo da incrementare il timeout.
pl: Negocjowanie protokołu nie powiodło się, po upływie {0} sekund został przekroczony limit czasu oczekiwania na odpowiedź. Przyczyną może być wolne działanie maszyny. Zwiększ limit czasu, ustawiając zmienną środowiskową {1}.
pt_br: Falha ao negociar o protocolo, aguardando pelo tempo limite de resposta após {0} segundos. Isso pode ocorrer devido à lentidão do computador. Defina a variável de ambiente {1} para aumentar o tempo limite.
ru: Не удалось согласовать протокол, превышено время ожидания ответа по прошествии {0} с. Это может происходить из-за медленной работы компьютера. Увеличьте время ожидания в переменной среды {1}.
tr: Protokol üzerinde anlaşmaya varılamadı, yanıt bekleme süresi {0} saniyenin ardından zaman aşımına uğradı. Bu durum makinenin yavaşlığından kaynaklanıyor olabilir, zaman aşımı süresini artırmak için lütfen ortam değişkenini {1} olarak ayarlayın.
zh_hans: 未能协商协议，等待响应在 {0} 秒后超时。出现此问题可能是因为计算机性能较低，请设置环境变量 {1}，增加超时时间值。
zh_hant: 無法交涉通訊協定，等待回應在 {0} 秒後已逾時。原因可能是電腦太慢，請設定環境變數 {1}，加長逾時。

# ConnectionTimeoutErrorMessage
source: {0} process failed to connect to {1} process after {2} seconds. This may occur due to machine slowness, please set environment variable {3} to increase timeout.
cs: Procesu {0} se nepovedlo připojit k procesu {1} ani po {2} s. Důvodem může být pomalý počítač. Nastavením proměnné prostředí {3} prosím časový limit prodlužte.
fr: Le processus {0} n’a pas réussi à se connecter au processus {1} après {2} secondes. Cette situation peut se produire à cause de la lenteur de la machine. Définissez la variable d’environnement {3} de sorte à augmenter le délai d’expiration.
it: Il processo {0} non è riuscito a connettersi al processo {1} dopo {2} secondi. Questo problema può verificarsi a causa della lentezza del computer. Impostare la variabile di ambiente {3} in modo da incrementare il timeout.
pl: Proces {0} nie mógł połączyć się z procesem {1} w ciągu {2} sekund. Przyczyną może być wolne działanie maszyny. Zwiększ limit czasu, ustawiając zmienną środowiskową {3}.
pt_br: O processo {0} falha ao se conectar ao processo {1} após {2} segundos. Isso pode ocorrer devido à lentidão do computador. Defina a variável de ambiente {3} para aumentar o tempo limite.
ru: Процесс {0} не смог подключиться к процессу {1} по прошествии {2} с. Это может происходить из-за медленной работы компьютера. Увеличьте время ожидания в переменной среды {3}.
tr: {0} işlemi, {2} saniye sonra {1} işlemine bağlanamadı. Bu durum makinenin yavaşlığından kaynaklanıyor olabilir, zaman aşımı süresini artırmak için lütfen ortam değişkenini {3} olarak ayarlayın.
zh_hans: {0} 进程未能在 {2} 秒后连接到 {1} 进程。出现此问题可能是因为计算机性能较低，请设置环境变量 {3}，增加超时时间值。
zh_hant: 在 {2} 秒後，{0} 處理序無法連線到 {1} 處理序。原因可能是電腦太慢，請設定環境變數 {3}，加長逾時。

source: Test host process crashed
cs: Proces testovacího hostitele se chybově ukončil.
fr: Plantage du processus hôte de test
it: Arresto anomalo del processo host di test
pl: Wystąpiła awaria procesu hosta testu
pt_br: Falha no processo do host de teste
ru: Сбой хост-процесса теста
tr: Test ana işlemi kilitlendi
zh_hans: 测试主机进程崩溃
zh_hant: 測試主機處理序當機

# AttachDebuggerToDefaultTestHostFailure
source: Cannot attach the debugger to the default test host.
cs: Ladicí program se nedá připojit k výchozímu hostiteli testů.
fr: Impossible d'attacher le débogueur à l'hôte de test par défaut.
it: Non è possibile collegare il debugger all'host di test predefinito.
pl: Nie można dołączyć debugera do domyślnego hosta testowego.
pt_br: Não é possível anexar o depurador ao host de teste padrão.
ru: Не удается подключить отладчик к узлу тестирования по умолчанию.
tr: Hata ayıklayıcı, varsayılan test ana bilgisayarına eklenemiyor.
zh_hans: 无法将调试程序附加到默认测试主机。
zh_hant: 無法將偵錯工具連結到預設測試主機。
